
## Plan Result




<pre><code>Plan: 0 to add, 7 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.ecm-database.azurerm_resource_group.data-resourcegroup
  * module.ecm-database.azurerm_template_deployment.postgres-paas
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.key-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.queue-namespace.azurerm_servicebus_namespace.servicebus_namespace


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat"
        name     = "ethos-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "environment"  = "aat"
          - "lastUpdated"  = "2023-04-20T09:03:48Z"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ecm-database.data.azurerm_postgresql_server.replica will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_postgresql_server" "replica"  {
      ~ administrator_login = "ecmconsumer" -> (known after apply)
      ~ fqdn                = "ethos-shared-ecm-db-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat/providers/Microsoft.DBforPostgreSQL/servers/ethos-shared-ecm-db-aat" -> (known after apply)
      ~ identity            = [] -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ethos-shared-ecm-db-aat"
      ~ sku_name            = "GP_Gen5_2" -> (known after apply)
      ~ tags                = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "environment"  = "aat"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
      ~ version             = "11" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.ecm-database.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat"
        name     = "ethos-shared-ecm-db-data-aat"
      ~ tags     = {
          + "businessArea" = "CFT"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.ecm-database.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat/providers/Microsoft.Resources/deployments/ethos-shared-ecm-db-aat"
        name                = "ethos-shared-ecm-db-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJEZXN0cm95IE1lIjoiTm8iLCJUZWFtIENvbnRhY3QiOiIjZXRob3MtcmVwbC1zZXJ2aWNlIiwiYXBwbGljYXRpb24iOiJldGhvcyIsImVudmlyb25tZW50IjoiYWF0IiwibWFuYWdlZEJ5IjoiRUNNIFByb2plY3QifQ==" -> "eyJEZXN0cm95IE1lIjoiTm8iLCJUZWFtIENvbnRhY3QiOiIjZXRob3MtcmVwbC1zZXJ2aWNlIiwiYXBwbGljYXRpb24iOiJldGhvcyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImVudmlyb25tZW50IjoiYWF0IiwibWFuYWdlZEJ5IjoiRUNNIFByb2plY3QifQ=="
          ~ "dbRules"                    = "W3sicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWM0ZjA3MDQtYTI5ZS00MDNkLWI3MTktYjkwYzM0ZWYxNGM5L3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtYWF0L3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWFhdC9zdWJuZXRzL2NvcmUtaW5mcmEtc3VibmV0LTMtYWF0In0seyJydWxlX25hbWUiOiJha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYzRmMDcwNC1hMjllLTQwM2QtYjcxOS1iOTBjMzRlZjE0YzkvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1hYXQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWluZnJhLXZuZXQtYWF0L3N1Ym5ldHMvYWtzIn0seyJydWxlX25hbWUiOiJha3MtYWF0LTAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2Frcy1pbmZyYS1hYXQtcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWFhdC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJha3MtYWF0LTAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2Frcy1pbmZyYS1hYXQtcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWFhdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcyIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9pYWFzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcy1hZ2VudCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0=" -> "W3sicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWM0ZjA3MDQtYTI5ZS00MDNkLWI3MTktYjkwYzM0ZWYxNGM5L3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtYWF0L3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWFhdC9zdWJuZXRzL2NvcmUtaW5mcmEtc3VibmV0LTMtYWF0In0seyJydWxlX25hbWUiOiJha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYzRmMDcwNC1hMjllLTQwM2QtYjcxOS1iOTBjMzRlZjE0YzkvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1hYXQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWluZnJhLXZuZXQtYWF0L3N1Ym5ldHMvYWtzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcyIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9pYWFzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcy1hZ2VudCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0="
            # (16 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat"
        name                            = "ethos-shared-aat"
      ~ tags                            = {
          + "businessArea" = "CFT"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                       = "ethos-shared-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ethos-aat-mi"
        name                = "ethos-aat-mi"
      ~ tags                = {
          + "businessArea" = "CFT"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.queue-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-servicebus-aat"
        name                                = "ethos-servicebus-aat"
      ~ tags                                = {
          + "businessArea" = "CFT"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_key_vault_secret.app_insights_connection_string has changed
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id             = "https://ethos-shared-aat.vault.azure.net/secrets/app-insights-connection-string/6dbde2e363c2473b9c15a03834e59b34"
        name           = "app-insights-connection-string"
      + tags           = {}
        # (5 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat|ethos-shared-aat"
        name                       = "ethos-shared-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Vars":{}} -->